# Найти корни квадратного уравнения Ax² + Bx + C = 0

a = int(input('Введите коэффициент A: '))
b = int(input('Введите коэффициент B '))
c = int(input('Введите коэффициент C: '))

D = b ** 2 - 4 * a * c
print(f'Дискриминант D = {D}')

if D < 0:
    print('Корней нет')
elif D == 0:
    x = -b / 2 * a
    print('Корень один')
    print(f'Корень 1:  {x}')
else:
    x1 = round((- b + D ** 0.5) / 2 * a, 2)
    x2 = round((- b - D ** 0.5) / 2 * a, 2)
    print('Кореней два')
    print(f' Корень 1:{x1} , корень 2:{x2}')
    