# Найти расстояние между двумя точками пространства

distance = 0
x1 = int(input('Введите координату X1: '))
x2 = int(input('Введите координату X2: '))
y1 = int(input('Введите координату Y1: '))
y2 = int(input('Введите координату Y2: '))

distance = ((x2**2 - x1**2)**1/2) + ((y2**2 - y1**2)**1/2)

print(distance)